---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarHookOverEndTreatment
source: html/3fa5a594-9ed9-d49e-177f-12989d9dd467.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarHookOverEndTreatment Property

Cannot set hook at an end that has end treatment.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarHookOverEndTreatment { get; }
```